{
  "architectures": [
    "InternS1ForConditionalGeneration"
  ],
  "auto_map": {
    "AutoConfig": "configuration_interns1.InternS1Config",
    "AutoModel": "modeling_interns1.InternS1Model",
    "AutoModelForCausalLM": "modeling_interns1.InternS1ForConditionalGeneration"
  },
  "downsample_ratio": 0.5,
  "image_seq_length": 256,
  "image_token_id": 152957,
  "model_type": "interns1",
  "projector_hidden_act": "gelu",
  "text_config": {
    "architectures": [
      "Qwen3MoeForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 151643,
    "decoder_sparse_step": 1,
    "eos_token_id": 151645,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "initializer_range": 0.02,
    "intermediate_size": 8192,
    "max_position_embeddings": 65536,
    "max_window_layers": 94,
    "mlp_only_layers": [],
    "model_type": "qwen3_moe",
    "moe_intermediate_size": 1536,
    "norm_topk_prob": true,
    "num_attention_heads": 64,
    "num_experts": 128,
    "num_experts_per_tok": 8,
    "num_hidden_layers": 94,
    "num_key_value_heads": 4,
    "output_router_logits": false,
    "rms_norm_eps": 1e-06,
    "rope_scaling": null,
    "rope_theta": 1000000.0,
    "router_aux_loss_coef": 0.001,
    "sliding_window": null,
    "torch_dtype": "bfloat16",
    "use_cache": true,
    "use_sliding_window": false,
    "vocab_size": 153216
  },
  "torch_dtype": "bfloat16",
  "transformers_version": "4.53.0",
  "vision_config": {
    "architectures": [
      "InternVisionModel"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "auto_map": {
      "AutoConfig": "configuration_interns1.InternS1VisionConfig",
      "AutoModel": "modeling_interns1.InternS1VisionModel"
    },
    "drop_path_rate": 0.1,
    "dropout": 0.0,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "hidden_size": 3200,
    "image_size": [
      448,
      448
    ],
    "initializer_factor": 0.1,
    "initializer_range": 1e-10,
    "intermediate_size": 12800,
    "layer_norm_eps": 1e-06,
    "layer_scale_init_value": 0.1,
    "model_type": "interns1_vision",
    "norm_type": "rms_norm",
    "num_attention_heads": 25,
    "num_channels": 3,
    "num_hidden_layers": 45,
    "patch_size": [
      14,
      14
    ],
    "projection_dropout": 0.0,
    "torch_dtype": "bfloat16",
    "use_absolute_position_embeddings": true,
    "use_bfloat16": true,
    "use_flash_attn": true,
    "use_mask_token": false,
    "use_mean_pooling": true,
    "use_qk_norm": true
  },
  "vision_feature_layer": -1,
  "vision_feature_select_strategy": "default"
}
