{
  "_class_name": "FlowMatchEulerDiscreteScheduler",
  "_diffusers_version": "0.33.0.dev0",
  "base_image_seq_len": 256,
  "base_shift": 0.25,
  "invert_sigmas": false,
  "max_image_seq_len": 4096,
  "max_shift": 0.75,
  "num_train_timesteps": 1000,
  "shift": 1.0,
  "shift_terminal": null,
  "time_shift_type": "linear",
  "use_beta_sigmas": false,
  "use_dynamic_shifting": true,
  "use_exponential_sigmas": false,
  "use_karras_sigmas": false
}
