{
  "_class_name": "UNet3DConditionModel",
  "_diffusers_version": "0.15.0.dev0",
  "_name_or_path": "/home/patrick_huggingface_co/.cache/huggingface/hub/models--damo-vilab--text-to-video-ms-1.7b/snapshots/32aa057809b033d6f3ca31da4b0ade1fa7904654/unet",
  "act_fn": "silu",
  "attention_head_dim": 64,
  "block_out_channels": [
    320,
    640,
    1280,
    1280
  ],
  "cross_attention_dim": 1024,
  "down_block_types": [
    "CrossAttnDownBlock3D",
    "CrossAttnDownBlock3D",
    "CrossAttnDownBlock3D",
    "DownBlock3D"
  ],
  "in_channels": 4,
  "layers_per_block": 2,
  "norm_eps": 1e-05,
  "norm_num_groups": 32,
  "out_channels": 4,
  "sample_size": 32,
  "up_block_types": [
    "UpBlock3D",
    "CrossAttnUpBlock3D",
    "CrossAttnUpBlock3D",
    "CrossAttnUpBlock3D"
  ]
}
